// Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// С использованием гугла
Console.Write("Enter numbers (use space): ");
double[] arr = Array.ConvertAll(Console.ReadLine().Split(), double.Parse);
int count = 0;
 
for (int i = 0; i < arr.Length; i++)
{
    if (arr[i] > 0)
    {
        count++;
    }
}
 
Console.WriteLine($"You enter {count} numbers more then zero");